---
title: PipeFittingAndAccessoryPressureDropItem
classe: Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropItem
namespace: Autodesk.Revit.DB.Plumbing
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# PipeFittingAndAccessoryPressureDropItem

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 BeginConnectorIndex { get; }` | `pipeFittingAndAccessoryPressureDropItem.BeginConnectorIndex` | Int32 |
| `Double Coefficient { get; set; }` | `pipeFittingAndAccessoryPressureDropItem.Coefficient` | Double |
| `Int32 EndConnectorIndex { get; }` | `pipeFittingAndAccessoryPressureDropItem.EndConnectorIndex` | Int32 |
| `Boolean IsValidObject { get; }` | `pipeFittingAndAccessoryPressureDropItem.IsValidObject` | Boolean |
| `Double VelocityPressure { get; }` | `pipeFittingAndAccessoryPressureDropItem.VelocityPressure` | Double |
| `Void Dispose()` | `pipeFittingAndAccessoryPressureDropItem.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```